In [2]:
from datascience import *
import numpy as np

%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')
import warnings
warnings.simplefilter(action='ignore', category=DeprecationWarning)

## Review

- conducted on https://polleverywhere.com/jeremysanchez

## New material

### One-column groups

In [3]:
cones = Table.read_table('cones.csv')
cones_without_color = cones.drop('Color')

In [4]:
cones_without_color

Flavor     | Price
strawberry | 3.55
chocolate  | 4.75
chocolate  | 5.25
strawberry | 5.25
chocolate  | 5.25
bubblegum  | 4.75

In [5]:
cones_without_color

Flavor     | Price
strawberry | 3.55
chocolate  | 4.75
chocolate  | 5.25
strawberry | 5.25
chocolate  | 5.25
bubblegum  | 4.75

In [6]:
cones_without_color.group('Flavor', np.average)

Flavor     | Price average
bubblegum  | 4.75
chocolate  | 5.08333
strawberry | 4.4

### Two-column groups

In [7]:
cones

Flavor     | Color       | Price
strawberry | pink        | 3.55
chocolate  | light brown | 4.75
chocolate  | dark brown  | 5.25
strawberry | pink        | 5.25
chocolate  | dark brown  | 5.25
bubblegum  | pink        | 4.75

In [8]:
cones.group(['Flavor','Color'],np.average)

Flavor     | Color       | Price average
bubblegum  | pink        | 4.75
chocolate  | dark brown  | 5.25
chocolate  | light brown | 4.75
strawberry | pink        | 4.4

In [10]:
cones.group(['Flavor','Color'], sum)

Flavor     | Color       | Price sum
bubblegum  | pink        | 4.75
chocolate  | dark brown  | 10.5
chocolate  | light brown | 4.75
strawberry | pink        | 8.8

### We can make our own collect functions!

In [9]:
nba = Table.read_table("nba_salaries.csv")
nba.show(6)

**Task/Discussion Question**: Write a function called `average_in_millions` which:
- finds the average of a set of numbers, `values`
- divides this average by 1 million.

In [11]:
def average_in_millions(values):
    return np.average(values)/1e6

In [12]:
average_in_millions(make_array(100,200))

0.00014999999999999999

**Task/Discussion Question**: There are 30 NBA teams. How many rows and how many columns will the table be that is produced by the following code [code given in lecture]?

In [13]:
nba.where('season',
          2020).select('team',
                       'salary').group('team', average_in_millions)

team                  | salary average_in_millions
Atlanta Hawks         | 5.37159
Boston Celtics        | 7.43857
Brooklyn Nets         | 6.97464
Charlotte Hornets     | 6.49526
Chicago Bulls         | 6.05126
Cleveland Cavaliers   | 7.31261
Dallas Mavericks      | 8.42969
Denver Nuggets        | 9.75706
Detroit Pistons       | 7.55149
Golden State Warriors | 8.15469
... (20 rows omitted)

____

#### **Challenge Task (`nba` dataset)**: Find the five teams paying the highest average salary (in millions) in 2010.
- Your results should be in the form of a table with 5 rows and 2 columns:
    - One column should have the team name
    - The other column should have the average salary for that team, in millions.
- Challenge: Try to only use `Table.select()` or `Table.drop()` *once* in your solution.

In [15]:
nba.where('season', 2010).select('team', 'salary').group('team', average_in_millions).sort(1, descending=True).show(5)

#### **Challenge Task (`nba` dataset)** Find the $n$ teams paying the highest average salary (in millions) in season $y$.
- In other words, write code that will produce the table you made above, but for any given $n$ and $y$.

Note that in this solution, we are calling the function `average_in_millions` inside of our `highest_paying_teams` function!!!

In [41]:
n = 7
y = 2019

In [42]:
nba.where('season', y).select('team', 'salary').group('team', average_in_millions).sort(1, descending=True).show(n)